In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
file_url = "https://drive.google.com/uc?id=1CKKoa9mb8ElLCREpS7Onh2zv1RxhEDlg"
df= pd.read_csv(file_url)
df.head()

              DateTime  Vehicles
0  2015-11-01 00:00:00        15
1  2015-11-01 01:00:00        13
2  2015-11-01 02:00:00        10
3  2015-11-01 03:00:00         7
4  2015-11-01 04:00:00         9

In [3]:
df.head(20)

               DateTime  Vehicles
0   2015-11-01 00:00:00        15
1   2015-11-01 01:00:00        13
2   2015-11-01 02:00:00        10
3   2015-11-01 03:00:00         7
4   2015-11-01 04:00:00         9
5   2015-11-01 05:00:00         6
6   2015-11-01 06:00:00         9
7   2015-11-01 07:00:00         8
8   2015-11-01 08:00:00        11
9   2015-11-01 09:00:00        12
10  2015-11-01 10:00:00        15
11  2015-11-01 11:00:00        17
12  2015-11-01 12:00:00        16
13  2015-11-01 13:00:00        15
14  2015-11-01 14:00:00        16
15  2015-11-01 15:00:00        12
16  2015-11-01 16:00:00        12
17  2015-11-01 17:00:00        16
18  2015-11-01 18:00:00        17
19  2015-11-01 19:00:00        20

In [4]:
df.head(10)

              DateTime  Vehicles
0  2015-11-01 00:00:00        15
1  2015-11-01 01:00:00        13
2  2015-11-01 02:00:00        10
3  2015-11-01 03:00:00         7
4  2015-11-01 04:00:00         9
5  2015-11-01 05:00:00         6
6  2015-11-01 06:00:00         9
7  2015-11-01 07:00:00         8
8  2015-11-01 08:00:00        11
9  2015-11-01 09:00:00        12

false means not empty

In [5]:
df.isnull()

       DateTime  Vehicles
0         False     False
1         False     False
2         False     False
3         False     False
4         False     False
...         ...       ...
14587     False     False
14588     False     False
14589     False     False
14590     False     False
14591     False     False

[14592 rows x 2 columns]

In [6]:
df.isnull().sum

<bound method DataFrame.sum of        DateTime  Vehicles
0         False     False
1         False     False
2         False     False
3         False     False
4         False     False
...         ...       ...
14587     False     False
14588     False     False
14589     False     False
14590     False     False
14591     False     False

[14592 rows x 2 columns]>

In [7]:
df.dtypes

DateTime    object
Vehicles     int64
dtype: object

In [8]:
df.describe()

           Vehicles
count  14592.000000
mean      45.052906
std       23.008345
min        5.000000
25%       27.000000
50%       40.000000
75%       59.000000
max      156.000000

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14592 entries, 0 to 14591
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  14592 non-null  object
 1   Vehicles  14592 non-null  int64
dtypes: int64(1), object(1)
memory usage: 228.1+ KB

In [10]:
df['DateTime']=pd.to_datetime(df['DateTime'])

In [11]:
df.info() #chectdatetime

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14592 entries, 0 to 14591
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   DateTime  14592 non-null  datetime64[ns]
 1   Vehicles  14592 non-null  int64
dtypes: datetime64[ns](1), int64(1)
memory usage: 228.1 KB

fill mere ma ['DateTime']

In [13]:
date_time_index = pd.date_range(df['DateTime'].min(), df['DateTime'].max(), freq='h')
date_time_index

DatetimeIndex(['2015-11-01 00:00:00', '2015-11-01 01:00:00',
               '2015-11-01 02:00:00', '2015-11-01 03:00:00',
               '2015-11-01 04:00:00', '2015-11-01 05:00:00',
               '2015-11-01 06:00:00', '2015-11-01 07:00:00',
               '2015-11-01 08:00:00', '2015-11-01 09:00:00',
               ...
               '2017-06-30 14:00:00', '2017-06-30 15:00:00',
               '2017-06-30 16:00:00', '2017-06-30 17:00:00',
               '2017-06-30 18:00:00', '2017-06-30 19:00:00',
               '2017-06-30 20:00:00', '2017-06-30 21:00:00',
               '2017-06-30 22:00:00', '2017-06-30 23:00:00'],
              dtype='datetime64[ns]', length=14592, freq='h')